/*
n이 홀수 일 때 (n+1)/2
1 2 3
2

1 2 3 4 5
2 4
4

1 2 3 4 5 6 7
2 4 6
4

1 2 3 4 5 6 7 8 9
2 4 6 8
4 8
8

1 2 3 4 5 6 7 8 9 10 11
2 4 6 8 10
4 8
8

1 2 3 4 5 6 7 8 9 10 11 12
2 4 6 8 10 12
4 8 12
8

1 2 3 4 5 6 7 8 9 10 11 12 13
2 4 6 8 10 12
4 8 12
8

1 2 3 4 5 6 7 8 9 10 11 12 13 14 15
2 4 6 8 10 12 14
4 8 12
8

1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16
*/

#include <iostream>
using namespace std;

int main(){
	int n;
	cin >> n;
	int result = 1;
	while(result*2 <= n){
		result *= 2;
	}
	cout << result;
	return 0;
	
}